In [1]:
%load_ext sql

In [2]:
%sql postgresql://student:student@127.0.0.1/sparkifydb

'Connected: student@sparkifydb'

In [3]:
%sql SELECT * FROM songplays LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[(1, 1542326457796, 44, 'paid', None, None, 637, 'Waterloo-Cedar Falls, IA', 'Mozilla/5.0 (Macintosh; Intel Mac OS X 10.9; rv:31.0) Gecko/20100101 Firefox/31.0'),
 (2, 1542326688796, 44, 'paid', None, None, 637, 'Waterloo-Cedar Falls, IA', 'Mozilla/5.0 (Macintosh; Intel Mac OS X 10.9; rv:31.0) Gecko/20100101 Firefox/31.0'),
 (3, 1542326926796, 44, 'paid', None, None, 637, 'Waterloo-Cedar Falls, IA', 'Mozilla/5.0 (Macintosh; Intel Mac OS X 10.9; rv:31.0) Gecko/20100101 Firefox/31.0'),
 (4, 1542327111796, 44, 'paid', None, None, 637, 'Waterloo-Cedar Falls, IA', 'Mozilla/5.0 (Macintosh; Intel Mac OS X 10.9; rv:31.0) Gecko/20100101 Firefox/31.0'),
 (5, 1542327312796, 44, 'paid', None, None, 637, 'Waterloo-Cedar Falls, IA', 'Mozilla/5.0 (Macintosh; Intel Mac OS X 10.9; rv:31.0) Gecko/20100101 Firefox/31.0')]

In [4]:
%sql SELECT * FROM users LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[(61, 'Samuel', 'Gonzalez', 'M', 'free'),
 (32, 'Lily', 'Burns', 'F', 'free'),
 (44, 'Aleena', 'Kirby', 'F', 'paid'),
 (3, 'Isaac', 'Valdez', 'M', 'free'),
 (97, 'Kate', 'Harrell', 'F', 'paid')]

In [5]:
%sql SELECT * FROM songs LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[('SOXILUQ12A58A7C72A', 'Jenny Take a Ride', 'ARP6N5A1187B99D1A3', 2004, Decimal('207.43791')),
 ('SOTCKKY12AB018A141', 'Sonnerie lalaleulé hi houuu', 'ARGSAFR1269FB35070', 0, Decimal('29.54404')),
 ('SOQOTLQ12AB01868D0', 'Clementina Santafè', 'ARGCY1Y1187B9A4FA5', 0, Decimal('153.33832')),
 ('SOFNOQK12AB01840FC', 'Kutt Free (DJ Volume Remix)', 'ARNNKDK1187B98BBD5', 0, Decimal('407.37914')),
 ('SOBCOSW12A8C13D398', 'Rumba De Barcelona', 'AR7SMBG1187B9B9066', 0, Decimal('218.38322'))]

In [6]:
%sql SELECT * FROM artists LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[('ARP6N5A1187B99D1A3', 'Mitch Ryder', 'Hamtramck, MI', Decimal('NaN'), Decimal('NaN')),
 ('ARGSAFR1269FB35070', 'Blingtones', '', Decimal('NaN'), Decimal('NaN')),
 ('ARGCY1Y1187B9A4FA5', 'Gloriana', 'Nashville, TN.', Decimal('36.16778'), Decimal('-86.77836')),
 ('ARNNKDK1187B98BBD5', 'Jinx', 'Zagreb Croatia', Decimal('45.80726'), Decimal('15.967600000000001')),
 ('AR7SMBG1187B9B9066', 'Los Manolos', '', Decimal('NaN'), Decimal('NaN'))]

In [7]:
%sql SELECT * FROM time LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[(datetime.datetime(2018, 11, 16, 0, 0, 57, 796000), 0, 16, 46, 11, 2018, 'Friday'),
 (datetime.datetime(2018, 11, 16, 0, 4, 48, 796000), 0, 16, 46, 11, 2018, 'Friday'),
 (datetime.datetime(2018, 11, 16, 0, 8, 46, 796000), 0, 16, 46, 11, 2018, 'Friday'),
 (datetime.datetime(2018, 11, 16, 0, 11, 51, 796000), 0, 16, 46, 11, 2018, 'Friday'),
 (datetime.datetime(2018, 11, 16, 0, 15, 12, 796000), 0, 16, 46, 11, 2018, 'Friday')]

## REMEMBER: Restart this notebook to close connection to `sparkifydb`
Each time you run the cells above, remember to restart this notebook to close the connection to your database. Otherwise, you won't be able to run your code in `create_tables.py`, `etl.py`, or `etl.ipynb` files since you can't make multiple connections to the same database (in this case, sparkifydb).